In [63]:
import pandas as pd

In [66]:
df = pd.read_csv("Week 7 data.csv")

In [107]:
df.dtypes

Unnamed: 0             int64
species               object
island                object
bill_length_mm       float64
bill_depth_mm        float64
flipper_length_mm    float64
body_mass_g          float64
sex                   object
year                   int64
dtype: object

In [70]:
df.isnull().sum()

Unnamed: 0            0
species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
year                  0
dtype: int64

In [93]:
df.isna().sum()

Unnamed: 0            0
species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
year                  0
dtype: int64

In [71]:
df['island'].unique()

array(['Torgersen', 'Biscoe', 'Dream'], dtype=object)

In [72]:
df['species'].unique()

array(['Adelie', 'Gentoo', 'Chinstrap'], dtype=object)

In [73]:
df['sex'].unique()

array(['male', 'female', nan], dtype=object)

In [74]:
df[df['sex']=='nan']

Empty DataFrame
Columns: [Unnamed: 0, species, island, bill_length_mm, bill_depth_mm, flipper_length_mm, body_mass_g, sex, year]
Index: []

In [78]:
df['sex']

0        male
1      female
2      female
3         NaN
4      female
        ...
339      male
340    female
341      male
342      male
343    female
Name: sex, Length: 344, dtype: object

In [102]:
df.isna().sum()

Unnamed: 0            0
species               0
island                0
bill_length_mm        2
bill_depth_mm         2
flipper_length_mm     2
body_mass_g           2
sex                  11
year                  0
dtype: int64

In [103]:
df[df.isnull().any(axis=1)]

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
3,4,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
8,9,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN,2007
9,10,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN,2007
10,11,Adelie,Torgersen,37.8,17.1,186.0,3300.0,NaN,2007
11,12,Adelie,Torgersen,37.8,17.3,180.0,3700.0,NaN,2007
47,48,Adelie,Dream,37.5,18.9,179.0,2975.0,NaN,2007
178,179,Gentoo,Biscoe,44.5,14.3,216.0,4100.0,NaN,2007
218,219,Gentoo,Biscoe,46.2,14.4,214.0,4650.0,NaN,2008
256,257,Gentoo,Biscoe,47.3,13.8,216.0,4725.0,NaN,2009
268,269,Gentoo,Biscoe,44.5,15.7,217.0,4875.0,NaN,2009
271,272,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN,2009

In [110]:
df.fillna({'body_mass_g': df['body_mass_g']. mean(),})

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,1,Adelie,Torgersen,39.1,18.7,181.0,3750.000000,male,2007
1,2,Adelie,Torgersen,39.5,17.4,186.0,3800.000000,female,2007
2,3,Adelie,Torgersen,40.3,18.0,195.0,3250.000000,female,2007
3,4,Adelie,Torgersen,NaN,NaN,NaN,4201.754386,NaN,2007
4,5,Adelie,Torgersen,36.7,19.3,193.0,3450.000000,female,2007
...,...,...,...,...,...,...,...,...,...
339,340,Chinstrap,Dream,55.8,19.8,207.0,4000.000000,male,2009
340,341,Chinstrap,Dream,43.5,18.1,202.0,3400.000000,female,2009
341,342,Chinstrap,Dream,49.6,18.2,193.0,3775.000000,male,2009
342,343,Chinstrap,Dream,50.8,19.0,210.0,4100.000000,male,2009
343,344,Chinstrap,Dream,50.2,18.7,198.0,3775.000000,female,2009

In [100]:
df.dropnull()

AttributeError: 'DataFrame' object has no attribute 'dropnull'

In [80]:
df.dtypes

Unnamed: 0             int64
species               object
island                object
bill_length_mm       float64
bill_depth_mm        float64
flipper_length_mm    float64
body_mass_g          float64
sex                   object
year                   int64
dtype: object

In [83]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         344 non-null    int64
 1   species            344 non-null    object
 2   island             344 non-null    object
 3   bill_length_mm     342 non-null    float64
 4   bill_depth_mm      342 non-null    float64
 5   flipper_length_mm  342 non-null    float64
 6   body_mass_g        342 non-null    float64
 7   sex                333 non-null    object
 8   year               344 non-null    int64
dtypes: float64(4), int64(2), object(3)
memory usage: 24.3+ KB

In [85]:
df[df['sex']=='female'].describe()

,Unnamed: 0,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
count,165.000000,165.000000,165.000000,165.000000,165.000000,165.000000
mean,173.436364,42.096970,16.425455,197.363636,3862.272727,2008.042424
std,99.081655,4.903476,1.795681,12.500776,666.172050,0.814140
min,2.000000,32.100000,13.100000,172.000000,2700.000000,2007.000000
25%,90.000000,37.600000,14.500000,187.000000,3350.000000,2007.000000
50%,171.000000,42.800000,17.000000,193.000000,3650.000000,2008.000000
75%,259.000000,46.200000,17.800000,210.000000,4550.000000,2009.000000
max,344.000000,58.000000,20.700000,222.000000,5200.000000,2009.000000

In [87]:
df[df['sex']=='male'].describe()

,Unnamed: 0,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
count,168.000000,168.000000,168.000000,168.000000,168.000000,168.000000
mean,175.196429,45.854762,17.891071,204.505952,4545.684524,2008.041667
std,97.987428,5.366896,1.863351,14.547876,787.628884,0.814202
min,1.000000,34.600000,14.100000,178.000000,3250.000000,2007.000000
25%,91.250000,40.975000,16.075000,193.000000,3900.000000,2007.000000
50%,174.500000,46.800000,18.450000,200.500000,4300.000000,2008.000000
75%,258.500000,50.325000,19.250000,219.000000,5312.500000,2009.000000
max,343.000000,59.600000,21.500000,231.000000,6300.000000,2009.000000

In [86]:
df.describe()

,Unnamed: 0,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
count,344.000000,342.000000,342.000000,342.000000,342.000000,344.000000
mean,172.500000,43.921930,17.151170,200.915205,4201.754386,2008.029070
std,99.448479,5.459584,1.974793,14.061714,801.954536,0.818356
min,1.000000,32.100000,13.100000,172.000000,2700.000000,2007.000000
25%,86.750000,39.225000,15.600000,190.000000,3550.000000,2007.000000
50%,172.500000,44.450000,17.300000,197.000000,4050.000000,2008.000000
75%,258.250000,48.500000,18.700000,213.000000,4750.000000,2009.000000
max,344.000000,59.600000,21.500000,231.000000,6300.000000,2009.000000

In [92]:
df[df['species']=='Gentoo'].describe()

,Unnamed: 0,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,year
count,124.000000,123.000000,123.000000,123.000000,123.000000,124.000000
mean,214.500000,47.504878,14.982114,217.186992,5076.016260,2008.080645
std,35.939764,3.081857,0.981220,6.484976,504.116237,0.792206
min,153.000000,40.900000,13.100000,203.000000,3950.000000,2007.000000
25%,183.750000,45.300000,14.200000,212.000000,4700.000000,2007.000000
50%,214.500000,47.300000,15.000000,216.000000,5000.000000,2008.000000
75%,245.250000,49.550000,15.700000,221.000000,5500.000000,2009.000000
max,276.000000,59.600000,17.300000,231.000000,6300.000000,2009.000000

In [111]:
df.head()

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,1,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,2,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,3,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,4,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,5,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [112]:
df1 = df[['species', 'island']]

In [113]:
df1

       species     island
0       Adelie  Torgersen
1       Adelie  Torgersen
2       Adelie  Torgersen
3       Adelie  Torgersen
4       Adelie  Torgersen
..         ...        ...
339  Chinstrap      Dream
340  Chinstrap      Dream
341  Chinstrap      Dream
342  Chinstrap      Dream
343  Chinstrap      Dream

[344 rows x 2 columns]

In [115]:
df.head()

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,1,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,2,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,3,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,4,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,5,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [122]:
df[['species', 'bill_length_mm']].groupby('species').mean()

           bill_length_mm
species
Adelie          38.791391
Chinstrap       48.833824
Gentoo          47.504878